const Tags = [
  {
    "id": "492",
    "name": "独立"
  },
  {
    "id": "19",
    "name": "动作"
  },
  {
    "id": "21",
    "name": "冒险"
  },
  {
    "id": "597",
    "name": "休闲"
  },
  {
    "id": "122",
    "name": "角色扮演"
  },
  {
    "id": "599",
    "name": "模拟"
  },
  {
    "id": "9",
    "name": "策略"
  },
  {
    "id": "4182",
    "name": "单人"
  },
  {
    "id": "493",
    "name": "抢先体验"
  },
  {
    "id": "113",
    "name": "免费开玩"
  },
  {
    "id": "3871",
    "name": "2D"
  },
  {
    "id": "4191",
    "name": "3D"
  },
  {
    "id": "4166",
    "name": "氛围"
  },
  {
    "id": "1684",
    "name": "奇幻"
  },
  {
    "id": "4305",
    "name": "彩色"
  },
  {
    "id": "1742",
    "name": "剧情丰富"
  },
  {
    "id": "3859",
    "name": "多人"
  },
  {
    "id": "1664",
    "name": "解谜"
  },
  {
    "id": "3834",
    "name": "探索"
  },
  {
    "id": "3964",
    "name": "像素图形"
  },
  {
    "id": "4726",
    "name": "可爱"
  },
  {
    "id": "128",
    "name": "大型多人在线"
  },
  {
    "id": "701",
    "name": "体育"
  },
  {
    "id": "3993",
    "name": "战斗"
  },
  {
    "id": "3839",
    "name": "第一人称"
  },
  {
    "id": "4667",
    "name": "暴力"
  },
  {
    "id": "4106",
    "name": "动作冒险"
  },
  {
    "id": "1773",
    "name": "街机"
  },
  {
    "id": "4085",
    "name": "动漫"
  },
  {
    "id": "4136",
    "name": "欢乐"
  },
  {
    "id": "699",
    "name": "竞速"
  },
  {
    "id": "3942",
    "name": "科幻"
  },
  {
    "id": "12095",
    "name": "色情内容"
  },
  {
    "id": "6650",
    "name": "裸露"
  },
  {
    "id": "1654",
    "name": "放松"
  },
  {
    "id": "1774",
    "name": "射击"
  },
  {
    "id": "1667",
    "name": "恐怖"
  },
  {
    "id": "7481",
    "name": "控制器"
  },
  {
    "id": "5350",
    "name": "阖家"
  },
  {
    "id": "1697",
    "name": "第三人称"
  },
  {
    "id": "4004",
    "name": "复古"
  },
  {
    "id": "4252",
    "name": "风格化"
  },
  {
    "id": "4345",
    "name": "血腥"
  },
  {
    "id": "7208",
    "name": "女性主角"
  },
  {
    "id": "1695",
    "name": "开放世界"
  },
  {
    "id": "1685",
    "name": "合作"
  },
  {
    "id": "1662",
    "name": "生存"
  },
  {
    "id": "1625",
    "name": "平台游戏"
  },
  {
    "id": "1775",
    "name": "玩家对战"
  },
  {
    "id": "4791",
    "name": "俯视"
  },
  {
    "id": "6426",
    "name": "选择取向"
  },
  {
    "id": "6730",
    "name": "玩家对战环境"
  },
  {
    "id": "4175",
    "name": "拟真"
  },
  {
    "id": "1719",
    "name": "喜剧"
  },
  {
    "id": "4342",
    "name": "黑暗"
  },
  {
    "id": "3799",
    "name": "视觉小说"
  },
  {
    "id": "4747",
    "name": "角色自定义"
  },
  {
    "id": "4195",
    "name": "卡通风格"
  },
  {
    "id": "7250",
    "name": "线性"
  },
  {
    "id": "5716",
    "name": "悬疑"
  },
  {
    "id": "3968",
    "name": "物理"
  },
  {
    "id": "6971",
    "name": "多结局"
  },
  {
    "id": "5379",
    "name": "2D 平台"
  },
  {
    "id": "3843",
    "name": "在线合作"
  },
  {
    "id": "1663",
    "name": "第一人称射击"
  },
  {
    "id": "3916",
    "name": "老式"
  },
  {
    "id": "1721",
    "name": "心理恐怖"
  },
  {
    "id": "4057",
    "name": "魔法"
  },
  {
    "id": "4026",
    "name": "困难"
  },
  {
    "id": "3810",
    "name": "沙盒"
  },
  {
    "id": "1708",
    "name": "战术"
  },
  {
    "id": "4172",
    "name": "中世纪"
  },
  {
    "id": "4231",
    "name": "动作角色扮演"
  },
  {
    "id": "21978",
    "name": "虚拟现实"
  },
  {
    "id": "4094",
    "name": "极简主义"
  },
  {
    "id": "4295",
    "name": "未来"
  },
  {
    "id": "1643",
    "name": "建造"
  },
  {
    "id": "1755",
    "name": "太空"
  },
  {
    "id": "1756",
    "name": "好评原声音轨"
  },
  {
    "id": "6815",
    "name": "手绘"
  },
  {
    "id": "1716",
    "name": "类 Rogue"
  },
  {
    "id": "1702",
    "name": "制作"
  },
  {
    "id": "1698",
    "name": "指向点击"
  },
  {
    "id": "12472",
    "name": "管理"
  },
  {
    "id": "5984",
    "name": "剧情"
  },
  {
    "id": "4562",
    "name": "卡通"
  },
  {
    "id": "3959",
    "name": "轻度 Rogue"
  },
  {
    "id": "4255",
    "name": "清版射击"
  },
  {
    "id": "4604",
    "name": "黑暗奇幻"
  },
  {
    "id": "7368",
    "name": "本地多人"
  },
  {
    "id": "5125",
    "name": "程序生成"
  },
  {
    "id": "5395",
    "name": "3D 平台"
  },
  {
    "id": "8945",
    "name": "资源管理"
  },
  {
    "id": "6129",
    "name": "逻辑"
  },
  {
    "id": "3798",
    "name": "横向滚屏"
  },
  {
    "id": "4486",
    "name": "自选历险体验"
  },
  {
    "id": "3978",
    "name": "生存恐怖"
  },
  {
    "id": "84",
    "name": "设计与插画"
  },
  {
    "id": "5611",
    "name": "成人"
  },
  {
    "id": "4947",
    "name": "爱情"
  },
  {
    "id": "9204",
    "name": "沉浸式模拟"
  },
  {
    "id": "5608",
    "name": "情感"
  },
  {
    "id": "1036",
    "name": "教育"
  },
  {
    "id": "4325",
    "name": "回合制战斗"
  },
  {
    "id": "5537",
    "name": "平台解谜"
  },
  {
    "id": "1646",
    "name": "砍杀"
  },
  {
    "id": "30358",
    "name": "自然"
  },
  {
    "id": "1741",
    "name": "回合战略"
  },
  {
    "id": "42804",
    "name": "动作类 Rogue"
  },
  {
    "id": "11014",
    "name": "互动小说"
  },
  {
    "id": "9130",
    "name": "动漫色情"
  },
  {
    "id": "87",
    "name": "实用工具"
  },
  {
    "id": "14139",
    "name": "回合制战术"
  },
  {
    "id": "7332",
    "name": "基地建设"
  },
  {
    "id": "7743",
    "name": "80 年代"
  },
  {
    "id": "3835",
    "name": "后末日"
  },
  {
    "id": "1678",
    "name": "战争"
  },
  {
    "id": "1659",
    "name": "僵尸"
  },
  {
    "id": "9551",
    "name": "恋爱模拟"
  },
  {
    "id": "17389",
    "name": "桌上游戏"
  },
  {
    "id": "1738",
    "name": "隐藏物体"
  },
  {
    "id": "6691",
    "name": "90 年代"
  },
  {
    "id": "4885",
    "name": "弹幕射击"
  },
  {
    "id": "1710",
    "name": "超现实"
  },
  {
    "id": "4434",
    "name": "日系角色扮演"
  },
  {
    "id": "1720",
    "name": "迷宫探索"
  },
  {
    "id": "3841",
    "name": "本地合作"
  },
  {
    "id": "1687",
    "name": "潜行"
  },
  {
    "id": "5900",
    "name": "步行模拟"
  },
  {
    "id": "5154",
    "name": "竞分"
  },
  {
    "id": "3987",
    "name": "历史"
  },
  {
    "id": "5094",
    "name": "记叙"
  },
  {
    "id": "10695",
    "name": "团队角色扮演"
  },
  {
    "id": "24904",
    "name": "工作场所不宜"
  },
  {
    "id": "4145",
    "name": "电影式"
  },
  {
    "id": "4711",
    "name": "重玩价值"
  },
  {
    "id": "15172",
    "name": "对话"
  },
  {
    "id": "1677",
    "name": "回合制"
  },
  {
    "id": "31275",
    "name": "基于文字"
  },
  {
    "id": "4168",
    "name": "军事"
  },
  {
    "id": "3814",
    "name": "第三人称射击"
  },
  {
    "id": "44868",
    "name": "LGBTQ+"
  },
  {
    "id": "4975",
    "name": "2.5D"
  },
  {
    "id": "4637",
    "name": "俯视射击"
  },
  {
    "id": "8369",
    "name": "调查"
  },
  {
    "id": "1673",
    "name": "外星人"
  },
  {
    "id": "5851",
    "name": "等角视角"
  },
  {
    "id": "5752",
    "name": "机器人"
  },
  {
    "id": "4115",
    "name": "赛博朋克"
  },
  {
    "id": "6869",
    "name": "非线性"
  },
  {
    "id": "3854",
    "name": "故事架构丰富 "
  },
  {
    "id": "5711",
    "name": "团队导向"
  },
  {
    "id": "5923",
    "name": "黑色幽默"
  },
  {
    "id": "6276",
    "name": "库存管理"
  },
  {
    "id": "10235",
    "name": "生活模拟"
  },
  {
    "id": "1666",
    "name": "卡牌游戏"
  },
  {
    "id": "9541",
    "name": "恶魔"
  },
  {
    "id": "12057",
    "name": "教程"
  },
  {
    "id": "1038",
    "name": "网络出版"
  },
  {
    "id": "10397",
    "name": "网络梗"
  },
  {
    "id": "17305",
    "name": "策略角色扮演"
  },
  {
    "id": "379975",
    "name": "点击游戏"
  },
  {
    "id": "4064",
    "name": "惊悚"
  },
  {
    "id": "5186",
    "name": "心理"
  },
  {
    "id": "7926",
    "name": "人工智能"
  },
  {
    "id": "1676",
    "name": "即时战略"
  },
  {
    "id": "3813",
    "name": "即时战术"
  },
  {
    "id": "4400",
    "name": "抽象"
  },
  {
    "id": "4695",
    "name": "经济"
  },
  {
    "id": "10808",
    "name": "灵异"
  },
  {
    "id": "5547",
    "name": "竞技场射击"
  },
  {
    "id": "5613",
    "name": "推理"
  },
  {
    "id": "1759",
    "name": "永久死亡"
  },
  {
    "id": "1644",
    "name": "驾驶"
  },
  {
    "id": "5673",
    "name": "现代"
  },
  {
    "id": "1770",
    "name": "棋盘游戏"
  },
  {
    "id": "3877",
    "name": "精确平台"
  },
  {
    "id": "5030",
    "name": "反乌托邦"
  },
  {
    "id": "4236",
    "name": "刷宝"
  },
  {
    "id": "16689",
    "name": "时间管理"
  },
  {
    "id": "1645",
    "name": "塔防"
  },
  {
    "id": "1714",
    "name": "迷幻"
  },
  {
    "id": "1734",
    "name": "快节奏"
  },
  {
    "id": "8013",
    "name": "软件"
  },
  {
    "id": "872",
    "name": "动画制作和建模"
  },
  {
    "id": "21725",
    "name": "战术角色扮演"
  },
  {
    "id": "4234",
    "name": "短篇"
  },
  {
    "id": "29482",
    "name": "类魂系列"
  },
  {
    "id": "4840",
    "name": "4 人本地"
  },
  {
    "id": "4328",
    "name": "城市营造"
  },
  {
    "id": "1751",
    "name": "漫画"
  },
  {
    "id": "15045",
    "name": "飞行"
  },
  {
    "id": "4598",
    "name": "架空历史"
  },
  {
    "id": "4684",
    "name": "战争游戏"
  },
  {
    "id": "4158",
    "name": "清版动作"
  },
  {
    "id": "5652",
    "name": "收集马拉松"
  },
  {
    "id": "1628",
    "name": "类银河战士恶魔城"
  },
  {
    "id": "7948",
    "name": "原声音轨"
  },
  {
    "id": "5363",
    "name": "破坏"
  },
  {
    "id": "1621",
    "name": "音乐"
  },
  {
    "id": "13906",
    "name": "游戏开发"
  },
  {
    "id": "16094",
    "name": "神话"
  },
  {
    "id": "1669",
    "name": "可模组化"
  },
  {
    "id": "32322",
    "name": "牌组构建"
  },
  {
    "id": "5577",
    "name": "RPG 制作大师"
  },
  {
    "id": "1693",
    "name": "经典"
  },
  {
    "id": "8122",
    "name": "关卡编辑"
  },
  {
    "id": "8666",
    "name": "奔跑"
  },
  {
    "id": "615955",
    "name": "懒人游戏"
  },
  {
    "id": "4036",
    "name": "跑酷"
  },
  {
    "id": "7569",
    "name": "网格导向动作"
  },
  {
    "id": "6378",
    "name": "犯罪"
  },
  {
    "id": "4474",
    "name": "电脑角色扮演"
  },
  {
    "id": "1743",
    "name": "格斗"
  },
  {
    "id": "4736",
    "name": "2D 格斗"
  },
  {
    "id": "4155",
    "name": "职业导向"
  },
  {
    "id": "4700",
    "name": "电影"
  },
  {
    "id": "791774",
    "name": "卡牌战斗"
  },
  {
    "id": "13782",
    "name": "试验性"
  },
  {
    "id": "1754",
    "name": "大型多人在线角色扮演"
  },
  {
    "id": "5411",
    "name": "唯美"
  },
  {
    "id": "784",
    "name": "视频制作"
  },
  {
    "id": "19995",
    "name": "黑色喜剧"
  },
  {
    "id": "15277",
    "name": "哲理"
  },
  {
    "id": "3878",
    "name": "竞技"
  },
  {
    "id": "5765",
    "name": "枪械改装"
  },
  {
    "id": "17894",
    "name": "猫"
  },
  {
    "id": "1100687",
    "name": "汽车模拟"
  },
  {
    "id": "1027",
    "name": "音频制作"
  },
  {
    "id": "5794",
    "name": "科学"
  },
  {
    "id": "4758",
    "name": "双摇杆射击"
  },
  {
    "id": "1752",
    "name": "节奏"
  },
  {
    "id": "4845",
    "name": "资本主义"
  },
  {
    "id": "4508",
    "name": "合作战役"
  },
  {
    "id": "4608",
    "name": "剑术"
  },
  {
    "id": "4150",
    "name": "二战"
  },
  {
    "id": "11104",
    "name": "车辆作战"
  },
  {
    "id": "916648",
    "name": "生物收集"
  },
  {
    "id": "6506",
    "name": "3D 格斗"
  },
  {
    "id": "7432",
    "name": "洛夫克拉夫特式"
  },
  {
    "id": "255534",
    "name": "自动化"
  },
  {
    "id": "4046",
    "name": "龙"
  },
  {
    "id": "176981",
    "name": "大逃杀"
  },
  {
    "id": "4364",
    "name": "大战略"
  },
  {
    "id": "16598",
    "name": "太空模拟"
  },
  {
    "id": "13190",
    "name": "美国"
  },
  {
    "id": "5055",
    "name": "电竞"
  },
  {
    "id": "10816",
    "name": "分屏"
  },
  {
    "id": "5372",
    "name": "阴谋"
  },
  {
    "id": "29363",
    "name": "3D 视觉"
  },
  {
    "id": "4835",
    "name": "六自由度"
  },
  {
    "id": "6052",
    "name": "黑色"
  },
  {
    "id": "87918",
    "name": "农场模拟"
  },
  {
    "id": "1665",
    "name": "三消"
  },
  {
    "id": "4202",
    "name": "贸易"
  },
  {
    "id": "4878",
    "name": "谐仿"
  },
  {
    "id": "220585",
    "name": "殖民模拟"
  },
  {
    "id": "4559",
    "name": "快速反应事件"
  },
  {
    "id": "198631",
    "name": "不可思议迷宫"
  },
  {
    "id": "5796",
    "name": "子弹时间"
  },
  {
    "id": "1651",
    "name": "讽刺"
  },
  {
    "id": "1445",
    "name": "软件培训"
  },
  {
    "id": "620519",
    "name": "英雄射击"
  },
  {
    "id": "5228",
    "name": "鲜血"
  },
  {
    "id": "3920",
    "name": "烹饪"
  },
  {
    "id": "9592",
    "name": "动态旁白"
  },
  {
    "id": "353880",
    "name": "刷宝射击游戏"
  },
  {
    "id": "1100689",
    "name": "开放世界生存制作"
  },
  {
    "id": "3952",
    "name": "哥特"
  },
  {
    "id": "22602",
    "name": "农业"
  },
  {
    "id": "6625",
    "name": "时空操控"
  },
  {
    "id": "24003",
    "name": "文字游戏"
  },
  {
    "id": "4102",
    "name": "战斗竞速"
  },
  {
    "id": "21006",
    "name": "地下"
  },
  {
    "id": "6915",
    "name": "武术"
  },
  {
    "id": "4777",
    "name": "华丽格斗"
  },
  {
    "id": "1732",
    "name": "体素"
  },
  {
    "id": "3955",
    "name": "角色动作"
  },
  {
    "id": "5981",
    "name": "采矿"
  },
  {
    "id": "1777",
    "name": "蒸汽朋克"
  },
  {
    "id": "4821",
    "name": "机甲"
  },
  {
    "id": "4853",
    "name": "政治性"
  },
  {
    "id": "10679",
    "name": "时空旅行"
  },
  {
    "id": "1084988",
    "name": "自走棋"
  },
  {
    "id": "1681",
    "name": "海盗"
  },
  {
    "id": "9564",
    "name": "狩猎"
  },
  {
    "id": "1638",
    "name": "狗"
  },
  {
    "id": "31579",
    "name": "少女游戏"
  },
  {
    "id": "7478",
    "name": "光明会"
  },
  {
    "id": "13070",
    "name": "纸牌"
  },
  {
    "id": "4190",
    "name": "欲罢不能"
  },
  {
    "id": "3934",
    "name": "沉浸式"
  },
  {
    "id": "5300",
    "name": "上帝模拟"
  },
  {
    "id": "4018",
    "name": "吸血鬼"
  },
  {
    "id": "17770",
    "name": "异步多人"
  },
  {
    "id": "1688",
    "name": "忍者"
  },
  {
    "id": "1723",
    "name": "动作即时战略"
  },
  {
    "id": "18594",
    "name": "全动态影像"
  },
  {
    "id": "13276",
    "name": "坦克"
  },
  {
    "id": "15564",
    "name": "钓鱼"
  },
  {
    "id": "1718",
    "name": "多人在线战术竞技"
  },
  {
    "id": "9271",
    "name": "集换式卡牌游戏"
  },
  {
    "id": "1717",
    "name": "六角格棋盘"
  },
  {
    "id": "5502",
    "name": "黑客"
  },
  {
    "id": "7702",
    "name": "叙事"
  },
  {
    "id": "5708",
    "name": "重制"
  },
  {
    "id": "97376",
    "name": "温馨惬意"
  },
  {
    "id": "4754",
    "name": "政治"
  },
  {
    "id": "4376",
    "name": "暗杀"
  },
  {
    "id": "809",
    "name": "照片编辑"
  },
  {
    "id": "9157",
    "name": "水底"
  },
  {
    "id": "180368",
    "name": "信仰"
  },
  {
    "id": "11123",
    "name": "仅鼠标"
  },
  {
    "id": "1671",
    "name": "超级英雄"
  },
  {
    "id": "1670",
    "name": "4X"
  },
  {
    "id": "5160",
    "name": "恐龙"
  },
  {
    "id": "5179",
    "name": "冷战"
  },
  {
    "id": "4161",
    "name": "即时"
  },
  {
    "id": "10383",
    "name": "交通运输"
  },
  {
    "id": "1730",
    "name": "推箱子"
  },
  {
    "id": "5432",
    "name": "编程"
  },
  {
    "id": "4242",
    "name": "剧集"
  },
  {
    "id": "552282",
    "name": "治愈系"
  },
  {
    "id": "26921",
    "name": "政治模拟"
  },
  {
    "id": "7178",
    "name": "社交聚会游戏"
  },
  {
    "id": "1680",
    "name": "劫掠"
  },
  {
    "id": "1647",
    "name": "西部"
  },
  {
    "id": "7782",
    "name": "非主流经典"
  },
  {
    "id": "7108",
    "name": "社交聚会"
  },
  {
    "id": "3965",
    "name": "史诗级"
  },
  {
    "id": "6310",
    "name": "外交"
  },
  {
    "id": "13382",
    "name": "射箭"
  },
  {
    "id": "1616",
    "name": "火车"
  },
  {
    "id": "6910",
    "name": "海军"
  },
  {
    "id": "16250",
    "name": "赌博"
  },
  {
    "id": "1091588",
    "name": "牌组构建式类 Rogue"
  },
  {
    "id": "8093",
    "name": "小游戏"
  },
  {
    "id": "51306",
    "name": " 外国"
  },
  {
    "id": "9803",
    "name": "雪"
  },
  {
    "id": "4994",
    "name": "海战"
  },
  {
    "id": "4137",
    "name": "超人类主义"
  },
  {
    "id": "1674",
    "name": "打字"
  },
  {
    "id": "7107",
    "name": "即时含暂停"
  },
  {
    "id": "769306",
    "name": "密室逃脱"
  },
  {
    "id": "454187",
    "name": "传统类 Rogue"
  },
  {
    "id": "13577",
    "name": "航海"
  },
  {
    "id": "11333",
    "name": "恶人主角"
  },
  {
    "id": "7423",
    "name": "狙击手"
  },
  {
    "id": "6041",
    "name": "马匹"
  },
  {
    "id": "14153",
    "name": "龙与地下城"
  },
  {
    "id": "56690",
    "name": "轨道射击"
  },
  {
    "id": "7622",
    "name": "越野"
  },
  {
    "id": "10437",
    "name": "益智问答"
  },
  {
    "id": "25085",
    "name": "触控"
  },
  {
    "id": "8253",
    "name": "基于音乐的程序生成"
  },
  {
    "id": "5390",
    "name": "时间竞速"
  },
  {
    "id": "14720",
    "name": "怀旧"
  },
  {
    "id": "17015",
    "name": "狼人"
  },
  {
    "id": "5230",
    "name": "续作"
  },
  {
    "id": "6702",
    "name": "火星"
  },
  {
    "id": "5348",
    "name": "模组"
  },
  {
    "id": "5153",
    "name": "Kickstarter"
  },
  {
    "id": "1254546",
    "name": "足球"
  },
  {
    "id": "5382",
    "name": "一战"
  },
  {
    "id": "4520",
    "name": "农场管理"
  },
  {
    "id": "1023537",
    "name": "复古射击"
  },
  {
    "id": "776177",
    "name": "360 全景视频"
  },
  {
    "id": "9994",
    "name": "体验"
  },
  {
    "id": "1649",
    "name": "游戏制作"
  },
  {
    "id": "12190",
    "name": "拳击"
  },
  {
    "id": "150626",
    "name": "游戏相关"
  },
  {
    "id": "92092",
    "name": "喷气机"
  },
  {
    "id": "5310",
    "name": "游戏工坊"
  },
  {
    "id": "1100686",
    "name": "疫病爆发模拟"
  },
  {
    "id": "4291",
    "name": "太空飞船"
  },
  {
    "id": "4184",
    "name": "棋类"
  },
  {
    "id": "71389",
    "name": "拼字"
  },
  {
    "id": "198913",
    "name": "摩托车"
  },
  {
    "id": "1733",
    "name": "低容错"
  },
  {
    "id": "7918",
    "name": "矮人"
  },
  {
    "id": "1736",
    "name": "乐高"
  },
  {
    "id": "123332",
    "name": "自行车"
  },
  {
    "id": "15339",
    "name": "纪录片"
  },
  {
    "id": "922563",
    "name": "Rogue 恶魔城"
  },
  {
    "id": "7038",
    "name": "高尔夫"
  },
  {
    "id": "1100688",
    "name": "医疗模拟"
  },
  {
    "id": "856791",
    "name": "非对称 VR"
  },
  {
    "id": "6948",
    "name": "罗马"
  },
  {
    "id": "19780",
    "name": "潜水艇"
  },
  {
    "id": "15954",
    "name": "无声主角"
  },
  {
    "id": "61357",
    "name": "电子音乐"
  },
  {
    "id": "1746",
    "name": "篮球"
  },
  {
    "id": "29855",
    "name": "情境"
  },
  {
    "id": "745697",
    "name": "社交推理"
  },
  {
    "id": "7113",
    "name": "众筹"
  },
  {
    "id": "6621",
    "name": "弹球"
  },
  {
    "id": "189941",
    "name": "器乐"
  },
  {
    "id": "1254552",
    "name": "美式橄榄球"
  },
  {
    "id": "1753",
    "name": "滑板"
  },
  {
    "id": "22955",
    "name": "迷你高尔夫"
  },
  {
    "id": "47827",
    "name": "摔角"
  },
  {
    "id": "42089",
    "name": "突发惊吓"
  },
  {
    "id": "12286",
    "name": "战锤 40K"
  },
  {
    "id": "8075",
    "name": "TrackIR"
  },
  {
    "id": "337964",
    "name": "摇滚乐"
  },
  {
    "id": "17927",
    "name": "台球"
  },
  {
    "id": "19568",
    "name": "骑车"
  },
  {
    "id": "11634",
    "name": "维京人"
  },
  {
    "id": "5727",
    "name": "棒球"
  },
  {
    "id": "3796",
    "name": "小说改编"
  },
  {
    "id": "96359",
    "name": "滑行"
  },
  {
    "id": "5914",
    "name": "网球"
  },
  {
    "id": "35079",
    "name": "工作模拟"
  },
  {
    "id": "14906",
    "name": "蓄意操控困难"
  },
  {
    "id": "11095",
    "name": "Boss Rush"
  },
  {
    "id": "15868",
    "name": "摩托车越野"
  },
  {
    "id": "17337",
    "name": "旅鼠"
  },
  {
    "id": "176733",
    "name": "消除"
  },
  {
    "id": "117648",
    "name": "8-bit 音乐"
  },
  {
    "id": "8461",
    "name": "精心编写"
  },
  {
    "id": "7328",
    "name": "保龄球"
  },
  {
    "id": "324176",
    "name": "冰球"
  },
  {
    "id": "1199779",
    "name": "撤离射击"
  },
  {
    "id": "603297",
    "name": "硬件"
  },
  {
    "id": "129761",
    "name": "ATV"
  },
  {
    "id": "28444",
    "name": "单板滑雪"
  },
  {
    "id": "252854",
    "name": "自行车越野"
  },
  {
    "id": "7309",
    "name": "滑雪"
  },
  {
    "id": "348922",
    "name": "Steam 主机"
  },
  {
    "id": "5407",
    "name": "标杆测试"
  },
  {
    "id": "33572",
    "name": "麻将"
  },
  {
    "id": "143739",
    "name": "电子"
  },
  {
    "id": "102530",
    "name": "精灵"
  },
  {
    "id": "27758",
    "name": "声控"
  },
  {
    "id": "6214",
    "name": "鸟"
  },
  {
    "id": "323922",
    "name": "无双"
  },
  {
    "id": "91114",
    "name": "商店管理"
  },
  {
    "id": "30927",
    "name": "狐狸"
  },
  {
    "id": "233824",
    "name": "长篇电影"
  },
  {
    "id": "42329",
    "name": "代码编写"
  },
  {
    "id": "49213",
    "name": "英式橄榄球"
  },
  {
    "id": "1220528",
    "name": "爱好模拟"
  },
  {
    "id": "158638",
    "name": "板球"
  },
  {
    "id": "847164",
    "name": "排球"
  },
  {
    "id": "5941",
    "name": "重启"
  },
  {
    "id": "363767",
    "name": "斯诺克"
  }
]
const tagDict:Record<string, string> = {
  "9": "策略",
  "19": "动作",
  "21": "冒险",
  "84": "设计与插画",
  "87": "实用工具",
  "113": "免费开玩",
  "122": "角色扮演",
  "128": "大型多人在线",
  "492": "独立",
  "493": "抢先体验",
  "597": "休闲",
  "599": "模拟",
  "699": "竞速",
  "701": "体育",
  "784": "视频制作",
  "809": "照片编辑",
  "872": "动画制作和建模",
  "1027": "音频制作",
  "1036": "教育",
  "1038": "网络出版",
  "1445": "软件培训",
  "1616": "火车",
  "1621": "音乐",
  "1625": "平台游戏",
  "1628": "类银河战士恶魔城",
  "1638": "狗",
  "1643": "建造",
  "1644": "驾驶",
  "1645": "塔防",
  "1646": "砍杀",
  "1647": "西部",
  "1649": "游戏制作",
  "1651": "讽刺",
  "1654": "放松",
  "1659": "僵尸",
  "1662": "生存",
  "1663": "第一人称射击",
  "1664": "解谜",
  "1665": "三消",
  "1666": "卡牌游戏",
  "1667": "恐怖",
  "1669": "可模组化",
  "1670": "4X",
  "1671": "超级英雄",
  "1673": "外星人",
  "1674": "打字",
  "1676": "即时战略",
  "1677": "回合制",
  "1678": "战争",
  "1680": "劫掠",
  "1681": "海盗",
  "1684": "奇幻",
  "1685": "合作",
  "1687": "潜行",
  "1688": "忍者",
  "1693": "经典",
  "1695": "开放世界",
  "1697": "第三人称",
  "1698": "指向点击",
  "1702": "制作",
  "1708": "战术",
  "1710": "超现实",
  "1714": "迷幻",
  "1716": "类 Rogue",
  "1717": "六角格棋盘",
  "1718": "多人在线战术竞技",
  "1719": "喜剧",
  "1720": "迷宫探索",
  "1721": "心理恐怖",
  "1723": "动作即时战略",
  "1730": "推箱子",
  "1732": "体素",
  "1733": "低容错",
  "1734": "快节奏",
  "1736": "乐高",
  "1738": "隐藏物体",
  "1741": "回合战略",
  "1742": "剧情丰富",
  "1743": "格斗",
  "1746": "篮球",
  "1751": "漫画",
  "1752": "节奏",
  "1753": "滑板",
  "1754": "大型多人在线角色扮演",
  "1755": "太空",
  "1756": "好评原声音轨",
  "1759": "永久死亡",
  "1770": "棋盘游戏",
  "1773": "街机",
  "1774": "射击",
  "1775": "玩家对战",
  "1777": "蒸汽朋克",
  "3796": "小说改编",
  "3798": "横向滚屏",
  "3799": "视觉小说",
  "3810": "沙盒",
  "3813": "即时战术",
  "3814": "第三人称射击",
  "3834": "探索",
  "3835": "后末日",
  "3839": "第一人称",
  "3841": "本地合作",
  "3843": "在线合作",
  "3854": "故事架构丰富 ",
  "3859": "多人",
  "3871": "2D",
  "3877": "精确平台",
  "3878": "竞技",
  "3916": "老式",
  "3920": "烹饪",
  "3934": "沉浸式",
  "3942": "科幻",
  "3952": "哥特",
  "3955": "角色动作",
  "3959": "轻度 Rogue",
  "3964": "像素图形",
  "3965": "史诗级",
  "3968": "物理",
  "3978": "生存恐怖",
  "3987": "历史",
  "3993": "战斗",
  "4004": "复古",
  "4018": "吸血鬼",
  "4026": "困难",
  "4036": "跑酷",
  "4046": "龙",
  "4057": "魔法",
  "4064": "惊悚",
  "4085": "动漫",
  "4094": "极简主义",
  "4102": "战斗竞速",
  "4106": "动作冒险",
  "4115": "赛博朋克",
  "4136": "欢乐",
  "4137": "超人类主义",
  "4145": "电影式",
  "4150": "二战",
  "4155": "职业导向",
  "4158": "清版动作",
  "4161": "即时",
  "4166": "氛围",
  "4168": "军事",
  "4172": "中世纪",
  "4175": "拟真",
  "4182": "单人",
  "4184": "棋类",
  "4190": "欲罢不能",
  "4191": "3D",
  "4195": "卡通风格",
  "4202": "贸易",
  "4231": "动作角色扮演",
  "4234": "短篇",
  "4236": "刷宝",
  "4242": "剧集",
  "4252": "风格化",
  "4255": "清版射击",
  "4291": "太空飞船",
  "4295": "未来",
  "4305": "彩色",
  "4325": "回合制战斗",
  "4328": "城市营造",
  "4342": "黑暗",
  "4345": "血腥",
  "4364": "大战略",
  "4376": "暗杀",
  "4400": "抽象",
  "4434": "日系角色扮演",
  "4474": "电脑角色扮演",
  "4486": "自选历险体验",
  "4508": "合作战役",
  "4520": "农场管理",
  "4559": "快速反应事件",
  "4562": "卡通",
  "4598": "架空历史",
  "4604": "黑暗奇幻",
  "4608": "剑术",
  "4637": "俯视射击",
  "4667": "暴力",
  "4684": "战争游戏",
  "4695": "经济",
  "4700": "电影",
  "4711": "重玩价值",
  "4726": "可爱",
  "4736": "2D 格斗",
  "4747": "角色自定义",
  "4754": "政治",
  "4758": "双摇杆射击",
  "4777": "华丽格斗",
  "4791": "俯视",
  "4821": "机甲",
  "4835": "六自由度",
  "4840": "4 人本地",
  "4845": "资本主义",
  "4853": "政治性",
  "4878": "谐仿",
  "4885": "弹幕射击",
  "4947": "爱情",
  "4975": "2.5D",
  "4994": "海战",
  "5030": "反乌托邦",
  "5055": "电竞",
  "5094": "记叙",
  "5125": "程序生成",
  "5153": "Kickstarter",
  "5154": "竞分",
  "5160": "恐龙",
  "5179": "冷战",
  "5186": "心理",
  "5228": "鲜血",
  "5230": "续作",
  "5300": "上帝模拟",
  "5310": "游戏工坊",
  "5348": "模组",
  "5350": "阖家",
  "5363": "破坏",
  "5372": "阴谋",
  "5379": "2D 平台",
  "5382": "一战",
  "5390": "时间竞速",
  "5395": "3D 平台",
  "5407": "标杆测试",
  "5411": "唯美",
  "5432": "编程",
  "5502": "黑客",
  "5537": "平台解谜",
  "5547": "竞技场射击",
  "5577": "RPG 制作大师",
  "5608": "情感",
  "5611": "成人",
  "5613": "推理",
  "5652": "收集马拉松",
  "5673": "现代",
  "5708": "重制",
  "5711": "团队导向",
  "5716": "悬疑",
  "5727": "棒球",
  "5752": "机器人",
  "5765": "枪械改装",
  "5794": "科学",
  "5796": "子弹时间",
  "5851": "等角视角",
  "5900": "步行模拟",
  "5914": "网球",
  "5923": "黑色幽默",
  "5941": "重启",
  "5981": "采矿",
  "5984": "剧情",
  "6041": "马匹",
  "6052": "黑色",
  "6129": "逻辑",
  "6214": "鸟",
  "6276": "库存管理",
  "6310": "外交",
  "6378": "犯罪",
  "6426": "选择取向",
  "6506": "3D 格斗",
  "6621": "弹球",
  "6625": "时空操控",
  "6650": "裸露",
  "6691": "90 年代",
  "6702": "火星",
  "6730": "玩家对战环境",
  "6815": "手绘",
  "6869": "非线性",
  "6910": "海军",
  "6915": "武术",
  "6948": "罗马",
  "6971": "多结局",
  "7038": "高尔夫",
  "7107": "即时含暂停",
  "7108": "社交聚会",
  "7113": "众筹",
  "7178": "社交聚会游戏",
  "7208": "女性主角",
  "7250": "线性",
  "7309": "滑雪",
  "7328": "保龄球",
  "7332": "基地建设",
  "7368": "本地多人",
  "7423": "狙击手",
  "7432": "洛夫克拉夫特式",
  "7478": "光明会",
  "7481": "控制器",
  "7569": "网格导向动作",
  "7622": "越野",
  "7702": "叙事",
  "7743": "80 年代",
  "7782": "非主流经典",
  "7918": "矮人",
  "7926": "人工智能",
  "7948": "原声音轨",
  "8013": "软件",
  "8075": "TrackIR",
  "8093": "小游戏",
  "8122": "关卡编辑",
  "8253": "基于音乐的程序生成",
  "8369": "调查",
  "8461": "精心编写",
  "8666": "奔跑",
  "8945": "资源管理",
  "9130": "动漫色情",
  "9157": "水底",
  "9204": "沉浸式模拟",
  "9271": "集换式卡牌游戏",
  "9541": "恶魔",
  "9551": "恋爱模拟",
  "9564": "狩猎",
  "9592": "动态旁白",
  "9803": "雪",
  "9994": "体验",
  "10235": "生活模拟",
  "10383": "交通运输",
  "10397": "网络梗",
  "10437": "益智问答",
  "10679": "时空旅行",
  "10695": "团队角色扮演",
  "10808": "灵异",
  "10816": "分屏",
  "11014": "互动小说",
  "11095": "Boss Rush",
  "11104": "车辆作战",
  "11123": "仅鼠标",
  "11333": "恶人主角",
  "11634": "维京人",
  "12057": "教程",
  "12095": "色情内容",
  "12190": "拳击",
  "12286": "战锤 40K",
  "12472": "管理",
  "13070": "纸牌",
  "13190": "美国",
  "13276": "坦克",
  "13382": "射箭",
  "13577": "航海",
  "13782": "试验性",
  "13906": "游戏开发",
  "14139": "回合制战术",
  "14153": "龙与地下城",
  "14720": "怀旧",
  "14906": "蓄意操控困难",
  "15045": "飞行",
  "15172": "对话",
  "15277": "哲理",
  "15339": "纪录片",
  "15564": "钓鱼",
  "15868": "摩托车越野",
  "15954": "无声主角",
  "16094": "神话",
  "16250": "赌博",
  "16598": "太空模拟",
  "16689": "时间管理",
  "17015": "狼人",
  "17305": "策略角色扮演",
  "17337": "旅鼠",
  "17389": "桌上游戏",
  "17770": "异步多人",
  "17894": "猫",
  "17927": "台球",
  "18594": "全动态影像",
  "19568": "骑车",
  "19780": "潜水艇",
  "19995": "黑色喜剧",
  "21006": "地下",
  "21725": "战术角色扮演",
  "21978": "虚拟现实",
  "22602": "农业",
  "22955": "迷你高尔夫",
  "24003": "文字游戏",
  "24904": "工作场所不宜",
  "25085": "触控",
  "26921": "政治模拟",
  "27758": "声控",
  "28444": "单板滑雪",
  "29363": "3D 视觉",
  "29482": "类魂系列",
  "29855": "情境",
  "30358": "自然",
  "30927": "狐狸",
  "31275": "基于文字",
  "31579": "少女游戏",
  "32322": "牌组构建",
  "33572": "麻将",
  "35079": "工作模拟",
  "42089": "突发惊吓",
  "42329": "代码编写",
  "42804": "动作类 Rogue",
  "44868": "LGBTQ+",
  "47827": "摔角",
  "49213": "英式橄榄球",
  "51306": " 外国",
  "56690": "轨道射击",
  "61357": "电子音乐",
  "71389": "拼字",
  "87918": "农场模拟",
  "91114": "商店管理",
  "92092": "喷气机",
  "96359": "滑行",
  "97376": "温馨惬意",
  "102530": "精灵",
  "117648": "8-bit 音乐",
  "123332": "自行车",
  "129761": "ATV",
  "143739": "电子",
  "150626": "游戏相关",
  "158638": "板球",
  "176733": "消除",
  "176981": "大逃杀",
  "180368": "信仰",
  "189941": "器乐",
  "198631": "不可思议迷宫",
  "198913": "摩托车",
  "220585": "殖民模拟",
  "233824": "长篇电影",
  "252854": "自行车越野",
  "255534": "自动化",
  "323922": "无双",
  "324176": "冰球",
  "337964": "摇滚乐",
  "348922": "Steam 主机",
  "353880": "刷宝射击游戏",
  "363767": "斯诺克",
  "379975": "点击游戏",
  "454187": "传统类 Rogue",
  "552282": "治愈系",
  "603297": "硬件",
  "615955": "懒人游戏",
  "620519": "英雄射击",
  "745697": "社交推理",
  "769306": "密室逃脱",
  "776177": "360 全景视频",
  "791774": "卡牌战斗",
  "847164": "排球",
  "856791": "非对称 VR",
  "916648": "生物收集",
  "922563": "Rogue 恶魔城",
  "1023537": "复古射击",
  "1084988": "自走棋",
  "1091588": "牌组构建式类 Rogue",
  "1100686": "疫病爆发模拟",
  "1100687": "汽车模拟",
  "1100688": "医疗模拟",
  "1100689": "开放世界生存制作",
  "1199779": "撤离射击",
  "1220528": "爱好模拟",
  "1254546": "足球",
  "1254552": "美式橄榄球"
}

export const convertTag = (tagId:string|number):string => {
  return tagDict[tagId.toString()]?? tagId
}